Revit 2026 API

# ISaveSharedCoordinatesCallbackForUnloadLocally Interface

---

An interface that is used to control Revit when trying to unload locally a Revit link with changes in shared coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ISaveSharedCoordinatesCallbackForUnloadLocally
```
```vb
Public Interface ISaveSharedCoordinatesCallbackForUnloadLocally
```
```cpp
public interface class ISaveSharedCoordinatesCallbackForUnloadLocally
```
```fsharp
type ISaveSharedCoordinatesCallbackForUnloadLocally = interface end
```

The ISaveSharedCoordinatesCallbackForUnloadLocally type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSaveModifiedLinksOptionForUnloadLocally | Determines whether Revit should save the link or not prior to unloading the link locally. |

#### Reference

Autodesk.Revit.DB Namespace